{
  "summary": "Janatha Vimukthi Peramuna (JVP; lit. 'People's Liberation Front') is a Marxist–Leninist communist party in Sri Lanka. The party was formerly a revolutionary movement and was involved in two armed uprisings against the government of Sri Lanka: once in 1971 (SLFP), and another in 1987–89 (UNP). The motive for both uprisings was to establish a socialist state.The JVP was initially a small organisation that became a well-organised party that could influence mainstream politics. Its members openly campaigned for the left-wing coalition government of the SLFP-led United Front. However, following their disillusion with the coalition, they began an insurrection against the Dominion of Ceylon in early 1971, which intensified following the ban on the party. The JVP's military wing, the Red Guard, captured over 76 police strongholds throughout the island of Ceylon.The JVP entered democratic politics in 1977 when President J.R. Jayewardene released the JVP leader, Rohana Wijeweera, from prison. Wijeweera contested in the 1982 presidential elections and was the third most successful candidate, winning 4.16% of the votes cast. Before the elections, he had been convicted by the Criminal Justice Commission (CJC) for conspiring to overthrow the state violently. The JVP launched a more organized insurrection for the second time in 1987 after the signing of the Indo-Sri Lanka Accord.\nFollowing Operation Combine and Wijeweera's death, the JVP returned to elections as the National Salvation Front. The surviving JVP members campaigned in the 1994 elections, but eventually withdrew and supported the nationalist Sri Lanka Freedom Party, the main opposition party at the time. In 2004, it joined the government as a part of the United People's Freedom Alliance and supported the government in its war against the Liberation Tigers of Tamil Eelam (LTTE), but subsequently left the coalition government. Later, it contested under its own national coalition, the National People's Power (NPP) and has since been a prominent third party in Sri Lankan politics."
}