{
  "summary": "The Lanka Sama Samaja Party, often abbreviated as LSSP (literally: Lanka Socialist Party, Sinhala: ලංකා සම සමාජ පක්ෂය, Tamil: லங்கா சமசமாஜக் கட்சி), is a major Trotskyist political party in Sri Lanka.\nIt was the first political party in Sri Lanka (then British Ceylon), having been founded in 1935 by Leslie Goonewardene, N. M.\nPerera, Colvin R.\nde Silva, Philip Gunawardena and Robert Gunawardena.\nIt currently is a member of the main ruling coalition in the government of Sri Lanka and is headed by Tissa Vitharana.\nThe party was founded with Leninist ideals, and is classified as a party with socialist aims. \nThe LSSP emerged as a major political force in the Sri Lankan independence movement during the 1940s, during which time the party was forced to go underground due to its opposition to the British war effort.\nThe party played an instrumental role in the Indian independence and later Quit India Movement through the Bolshevik–Leninist Party of India, Ceylon and Burma (BLPI).\nThrough its efforts, India gained Independence from Britain in 1947, followed by Sri Lanka in 1948. \nIn the late early 1950s, the LSSP took the lead in organising the Hartal strike, caused by vast food price inflation by the UNP government.\nAt the time, J. R.\nJayawardena was the finance minister of the country.\nMaintaining the price of rice at 25 cents had been an electoral promise given by UNP in the 1952 elections, and when the new rates of 70 cents were introduced to the public there was a massive anger against it. \nFrom the late 1940s to 1960s, the Lanka Sama Samaja Party served as the opposition Party in Sri Lanka, whilst being recognised as the Sri Lankan wing of the Fourth International, an organisation characterised by Trotskyism.\nDuring this period, the party was able to use its considerable political influence to reform the former British Colony of Ceylon into a socialist republic by nationalising organisations in the banking, education, industry, media and trade sectors.\nIn 1964, the party joined the United Front (Sri Lanka), and formed the Socialist SLFP government, leading to its expulsion from the Fourth International.\nThrough their election landslide in 1964, they brought the world's first non-hereditary female head of government in modern history, Sirimavo Bandaranaike to power as Prime Minister of Sri Lanka.\nThe party peaked in political strength in the 1970s, when it was again leading a coalition government with multiple of its leaders in key cabinet roles. \nIn recent elections, the party has served a role in the coalition government.\nAs of 2020, the party holds local government roles, as well as the governorship of the North Central Province. "
}